----------------------------------------------------------------
        Layer (type)               Output Shape         Param #			Primera Capa
================================================================
            Conv2d-1         [-1, 32, 384, 288]             864
       BatchNorm2d-2         [-1, 32, 384, 288]              64
             ReLU6-3         [-1, 32, 384, 288]               0
         MaxPool2d-4         [-1, 32, 192, 144]               0
		 
		 
		 
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #		0	Bottleneck expansion_ratio = 1, output_channels = 16, n = 1, stride = 1
================================================================
            Conv2d-5         [-1, 32, 192, 144]             288
       BatchNorm2d-6         [-1, 32, 192, 144]              64
             ReLU6-7         [-1, 32, 192, 144]               0
            Conv2d-8         [-1, 16, 192, 144]             512
       BatchNorm2d-9         [-1, 16, 192, 144]              32
 InvertedResidual-10         [-1, 16, 192, 144]               0
 
 
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #		1	Bottleneck expansion_ratio = 6, output_channels = 24, n = 2, stride = 2
================================================================
           Conv2d-11         [-1, 96, 192, 144]           1,536
      BatchNorm2d-12         [-1, 96, 192, 144]             192
            ReLU6-13         [-1, 96, 192, 144]               0
           Conv2d-14           [-1, 96, 96, 72]             864
      BatchNorm2d-15           [-1, 96, 96, 72]             192
            ReLU6-16           [-1, 96, 96, 72]               0
           Conv2d-17           [-1, 24, 96, 72]           2,304
      BatchNorm2d-18           [-1, 24, 96, 72]              48
 InvertedResidual-19           [-1, 24, 96, 72]               0
 
           Conv2d-20          [-1, 144, 96, 72]           3,456
      BatchNorm2d-21          [-1, 144, 96, 72]             288
            ReLU6-22          [-1, 144, 96, 72]               0
           Conv2d-23          [-1, 144, 96, 72]           1,296
      BatchNorm2d-24          [-1, 144, 96, 72]             288
            ReLU6-25          [-1, 144, 96, 72]               0
           Conv2d-26           [-1, 24, 96, 72]           3,456
      BatchNorm2d-27           [-1, 24, 96, 72]              48
 InvertedResidual-28           [-1, 24, 96, 72]               0
 
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #		2	Bottleneck expansion_ratio = 6, output_channels = 32, n = 1, stride = 2
================================================================
           Conv2d-29          [-1, 144, 96, 72]           3,456
      BatchNorm2d-30          [-1, 144, 96, 72]             288
            ReLU6-31          [-1, 144, 96, 72]               0
           Conv2d-32          [-1, 144, 48, 36]           1,296
      BatchNorm2d-33          [-1, 144, 48, 36]             288
            ReLU6-34          [-1, 144, 48, 36]               0
           Conv2d-35           [-1, 32, 48, 36]           4,608
      BatchNorm2d-36           [-1, 32, 48, 36]              64
 InvertedResidual-37           [-1, 32, 48, 36]               0
 
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #		3	Bottleneck expansion_ratio = 6, output_channels = 64, n = 3, stride = 2
================================================================
           Conv2d-38          [-1, 192, 48, 36]           6,144
      BatchNorm2d-39          [-1, 192, 48, 36]             384
            ReLU6-40          [-1, 192, 48, 36]               0
           Conv2d-41          [-1, 192, 24, 18]           1,728
      BatchNorm2d-42          [-1, 192, 24, 18]             384
            ReLU6-43          [-1, 192, 24, 18]               0
           Conv2d-44           [-1, 64, 24, 18]          12,288
      BatchNorm2d-45           [-1, 64, 24, 18]             128
 InvertedResidual-46           [-1, 64, 24, 18]               0
 
           Conv2d-47          [-1, 384, 24, 18]          24,576
      BatchNorm2d-48          [-1, 384, 24, 18]             768
            ReLU6-49          [-1, 384, 24, 18]               0
           Conv2d-50          [-1, 384, 24, 18]           3,456
      BatchNorm2d-51          [-1, 384, 24, 18]             768
            ReLU6-52          [-1, 384, 24, 18]               0
           Conv2d-53           [-1, 64, 24, 18]          24,576
      BatchNorm2d-54           [-1, 64, 24, 18]             128
 InvertedResidual-55           [-1, 64, 24, 18]               0
 
           Conv2d-56          [-1, 384, 24, 18]          24,576
      BatchNorm2d-57          [-1, 384, 24, 18]             768
            ReLU6-58          [-1, 384, 24, 18]               0
           Conv2d-59          [-1, 384, 24, 18]           3,456
      BatchNorm2d-60          [-1, 384, 24, 18]             768
            ReLU6-61          [-1, 384, 24, 18]               0
           Conv2d-62           [-1, 64, 24, 18]          24,576
      BatchNorm2d-63           [-1, 64, 24, 18]             128
 InvertedResidual-64           [-1, 64, 24, 18]               0
 
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #		4	Bottleneck expansion_ratio = 6, output_channels = 96, n = 1, stride = 1
================================================================
           Conv2d-65          [-1, 384, 24, 18]          24,576
      BatchNorm2d-66          [-1, 384, 24, 18]             768
            ReLU6-67          [-1, 384, 24, 18]               0
           Conv2d-68          [-1, 384, 24, 18]           3,456
      BatchNorm2d-69          [-1, 384, 24, 18]             768
            ReLU6-70          [-1, 384, 24, 18]               0
           Conv2d-71           [-1, 96, 24, 18]          36,864
      BatchNorm2d-72           [-1, 96, 24, 18]             192
 InvertedResidual-73           [-1, 96, 24, 18]               0
 
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #		5	Bottleneck expansion_ratio = 6, output_channels = 160, n = 2, stride = 2
================================================================
           Conv2d-74          [-1, 576, 24, 18]          55,296
      BatchNorm2d-75          [-1, 576, 24, 18]           1,152
            ReLU6-76          [-1, 576, 24, 18]               0
           Conv2d-77           [-1, 576, 12, 9]           5,184
      BatchNorm2d-78           [-1, 576, 12, 9]           1,152
            ReLU6-79           [-1, 576, 12, 9]               0
           Conv2d-80           [-1, 160, 12, 9]          92,160
      BatchNorm2d-81           [-1, 160, 12, 9]             320
 InvertedResidual-82           [-1, 160, 12, 9]               0
 
           Conv2d-83           [-1, 960, 12, 9]         153,600
      BatchNorm2d-84           [-1, 960, 12, 9]           1,920
            ReLU6-85           [-1, 960, 12, 9]               0
           Conv2d-86           [-1, 960, 12, 9]           8,640
      BatchNorm2d-87           [-1, 960, 12, 9]           1,920
            ReLU6-88           [-1, 960, 12, 9]               0
           Conv2d-89           [-1, 160, 12, 9]         153,600
      BatchNorm2d-90           [-1, 160, 12, 9]             320
 InvertedResidual-91           [-1, 160, 12, 9]               0
 
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #		6	Bottleneck expansion_ratio = 6, output_channels = 320, n = 21, stride = 1
================================================================
           Conv2d-92           [-1, 960, 12, 9]         153,600
      BatchNorm2d-93           [-1, 960, 12, 9]           1,920
            ReLU6-94           [-1, 960, 12, 9]               0
           Conv2d-95           [-1, 960, 12, 9]           8,640
      BatchNorm2d-96           [-1, 960, 12, 9]           1,920
            ReLU6-97           [-1, 960, 12, 9]               0
           Conv2d-98           [-1, 320, 12, 9]         307,200
      BatchNorm2d-99           [-1, 320, 12, 9]             640
InvertedResidual-100           [-1, 320, 12, 9]               0

----------------------------------------------------------------
        Layer (type)               Output Shape         Param #			Ultima capa cnvolucional
================================================================
          Conv2d-101          [-1, 1280, 12, 9]         409,600
     BatchNorm2d-102          [-1, 1280, 12, 9]           2,560
           ReLU6-103          [-1, 1280, 12, 9]               0
         Dropout-104          [-1, 1280, 12, 9]               0
		   
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #			Clasificador
================================================================
          Linear-105                  [-1, 160]         204,960
     BatchNorm1d-106                  [-1, 160]             320
           ReLU6-107                  [-1, 160]               0
          Linear-108                    [-1, 5]             805
         Softmax-109                    [-1, 5]               0
		 
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #			Regresion para la direccion
================================================================
          Linear-110                   [-1, 80]         102,480
     BatchNorm1d-111                   [-1, 80]             160
           ReLU6-112                   [-1, 80]               0
          Linear-113                    [-1, 4]             324

================================================================
Total params: 1,892,409
Trainable params: 1,892,409
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 5.06
Forward/backward pass size (MB): 334.50
Params size (MB): 7.22
Estimated Total Size (MB): 346.78
----------------------------------------------------------------
